# Import Modules

In [232]:
import numpy as np
import pandas as pd

# Data Collection

In [233]:
data = pd.read_csv('Cleaned_Car_data.csv')
data.shape

(816, 7)

In [234]:
data.head()

,Unnamed: 0,name,company,year,Price,kms_driven,fuel_type
0,0,Hyundai Santro Xing,Hyundai,2007,80000,45000,Petrol
1,1,Mahindra Jeep CL550,Mahindra,2006,425000,40,Diesel
2,2,Hyundai Grand i10,Hyundai,2014,325000,28000,Petrol
3,3,Ford EcoSport Titanium,Ford,2014,575000,36000,Diesel
4,4,Ford Figo,Ford,2012,175000,41000,Diesel

In [235]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  816 non-null    int64
 1   name        816 non-null    object
 2   company     816 non-null    object
 3   year        816 non-null    int64
 4   Price       816 non-null    int64
 5   kms_driven  816 non-null    int64
 6   fuel_type   816 non-null    object
dtypes: int64(4), object(3)
memory usage: 44.8+ KB

In [236]:
data.isnull().sum()

Unnamed: 0    0
name          0
company       0
year          0
Price         0
kms_driven    0
fuel_type     0
dtype: int64

In [237]:
list(data.select_dtypes(['object']).columns) # Data Type Object Columns in dataset

['name', 'company', 'fuel_type']

In [238]:
data.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Unnamed: 0,816.0,NaN,NaN,NaN,407.5,235.703203,0.0,203.75,407.5,611.25,815.0
name,816,254,Maruti Suzuki Swift,51,NaN,NaN,NaN,NaN,NaN,NaN,NaN
company,816,25,Maruti,221,NaN,NaN,NaN,NaN,NaN,NaN,NaN
year,816.0,NaN,NaN,NaN,2012.444853,4.002992,1995.0,2010.0,2013.0,2015.0,2019.0
Price,816.0,NaN,NaN,NaN,411717.615196,475184.422264,30000.0,175000.0,299999.0,491250.0,8500003.0
kms_driven,816.0,NaN,NaN,NaN,46275.531863,34297.428044,0.0,27000.0,41000.0,56818.5,400000.0
fuel_type,816,3,Petrol,428,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [239]:
data['company'].unique()

array(['Hyundai', 'Mahindra', 'Ford', 'Maruti', 'Skoda', 'Audi', 'Toyota',
       'Renault', 'Honda', 'Datsun', 'Mitsubishi', 'Tata', 'Volkswagen',
       'Chevrolet', 'Mini', 'BMW', 'Nissan', 'Hindustan', 'Fiat', 'Force',
       'Mercedes', 'Land', 'Jaguar', 'Jeep', 'Volvo'], dtype=object)

# Extracting Training Data

In [240]:
X=data[['name','company','year','kms_driven','fuel_type']]
y=data['Price']
X

                       name   company  year  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006          40    Diesel
2         Hyundai Grand i10   Hyundai  2014       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014       36000    Diesel
4                 Ford Figo      Ford  2012       41000    Diesel
..                      ...       ...   ...         ...       ...
811      Maruti Suzuki Ritz    Maruti  2011       50000    Petrol
812          Tata Indica V2      Tata  2009       30000    Diesel
813    Toyota Corolla Altis    Toyota  2009      132000    Petrol
814            Tata Zest XM      Tata  2018       27000    Diesel
815      Mahindra Quanto C8  Mahindra  2013       40000    Diesel

[816 rows x 5 columns]

In [241]:
print(X.shape, y.shape)

(816, 5) (816,)

# Split dataset into training set and test set

In [242]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X, y, test_size=0.2, random_state=1100)

from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

### Creating an OneHotEncoder object to contain all the possible categories

In [243]:
one=OneHotEncoder(handle_unknown = 'ignore')
one.fit(X[['name','company','fuel_type']])

OneHotEncoder(handle_unknown='ignore')

### Creating a column transformer to transform categorical columns

In [244]:
column_trans=make_column_transformer((OneHotEncoder(categories=one.categories_),['name','company','fuel_type']),
                                    remainder='passthrough')

In [245]:
from sklearn.linear_model import LinearRegression

from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [246]:
lr = LinearRegression()

In [247]:
model = make_pipeline(column_trans,lr)

In [248]:
model.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(categories=[array(['Audi A3 Cabriolet', 'Audi A4 1.8', 'Audi A4 2.0', 'Audi A6 2.0',
       'Audi A8', 'Audi Q3 2.0', 'Audi Q5 2.0', 'Audi Q7', 'BMW 3 Series',
       'BMW 5 Series', 'BMW 7 Series', 'BMW X1', 'BMW X1 sDrive20d',
       'BMW X1 xDrive20d', 'Chevrolet Beat', 'Chevrolet Beat...
                                                                            array(['Audi', 'BMW', 'Chevrolet', 'Datsun', 'Fiat', 'Force', 'Ford',
       'Hindustan', 'Honda', 'Hyundai', 'Jaguar', 'Jeep', 'Land',
       'Mahindra', 'Maruti', 'Mercedes', 'Mini', 'Mitsubishi', 'Nissan',
       'Renault', 'Skoda', 'Tata', 'Toyota', 'Volkswagen', 'Volvo'],
      dtype=object),
                                                                            array(['Diesel', 'LPG', 'Petrol'], dtype=object)]),
                                                  ['name', 'company',
                                                   'fuel_type'])])),
                ('linearregression', LinearRegression())])

In [249]:
y_pred=model.predict(X_test)

## Finding the model with a random state of TrainTestSplit where the model was found to give Best Accuracy

In [250]:
scores=[]
for i in range(1000):
    X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.1,random_state=i)
    lr=LinearRegression()
    model=make_pipeline(column_trans,lr)
    model.fit(X_train,y_train)
    y_pred=model.predict(X_test)
    scores.append(r2_score(y_test,y_pred))

In [251]:
scores[np.argmax(scores)]

0.9210018258125283

In [252]:
r2_score = r2_score(y_test,y_pred)
r2_score

0.8322167232593571

In [253]:
input = pd.DataFrame(columns=X_test.columns,data=np.array(['Mahindra Quanto C8','Mahindra',2013,40000,'Diesel']).reshape(1,5))
model.predict(input)

array([353009.2356352])

In [254]:
import pickle

In [255]:
filename = 'car_model.sav'
pickle.dump(model, open(filename, 'wb'))

In [256]:
loaded_model = pickle.load(open('car_model.sav', 'rb'))

In [257]:
for column in X.columns:
  print(column)

name
company
year
kms_driven
fuel_type